Removed isSampledIn property from ingest session metadata and defaulted to true.
